export const colors = {
  primary: '#4CAF50', // Зеленый
  secondary: '#8BC34A', // Светло-зеленый
  background: '#121212', // Темно-серый, почти черный
  text: '#FFFFFF', // Белый
  textLight: '#BBBBBB', // Светло-серый
  success: '#66BB6A', // Зеленый для доходов
  danger: '#EF5350', // Красный для расходов
  warning: '#FFCA28', // Желтый
  card: '#1E1E1E', // Темно-серый для карточек
  border: '#333333', // Темная граница
  inactive: '#666666', // Неактивные элементы
};

export const categoryColors = [
  '#4CAF50', // Зеленый
  '#8BC34A', // Светло-зеленый
  '#CDDC39', // Лаймовый
  '#00BCD4', // Голубой
  '#3F51B5', // Индиго
  '#9C27B0', // Фиолетовый
  '#E91E63', // Розовый
  '#FF5722', // Оранжевый
  '#FFC107', // Янтарный
  '#607D8B', // Сине-серый
];